## Lambda (or anonymous) Functions

* Unlike our ```def``` defined functions, lambdas have no name.
* Think of them as throwaway, or single use functions.

## A defined function that squares a number:

In [ ]:
## square a number
def square(number):
    return pow(number,2)

In [ ]:
## call the function on the number 4 and store in variable called result
result = square(2)
result

# Now as a Lambda function
## ```lambda arguments: expression```

In [ ]:
## lambda expression
lambda x: pow(x, 2)

## In your google searches you will find people assigning lambda function to a variable.
## That is considered *wrong* primarily for debugging reasons.

### For more info, search for "lambda" in the <a href="https://www.python.org/dev/peps/pep-0008/#programming-recommendations">PEP guide (the official Python style guide)</a>

In [49]:
## wrong like this:
sq = lambda x: pow(x, 2)

In [50]:
## running as a function
sq(7)

49

## Lambda's usefulness comes from being:
* Quick throwaway, one-time use functions,
* Because they are throwaway, people usually use x, y, z variable names
* Used in conjunction with functions like ```map()``` and ```filter()```, and
* In Pandas when using ```apply()```.

In [23]:
### RUN THIS CELL

list1 = [1, 2, 3, 4, 5, 6]
list1

[1, 2, 3, 4, 5, 6]

### Remember that map() takes 2 arguments:
- a function
- an interable

```map(my_function, a_list)```

In [24]:
# Using map() create list called sq_list1

sq_list1 = list(map(lambda x: pow(x, 2), list1))

In [25]:
### PRINT the list
sq_list1

[1, 4, 9, 16, 25, 36]

## filter() takes 2 arguments:
- a function that checks a condition
- and an iterable

``` filter(condition_check_Function, my_iterable)```

In [42]:
## RUN THIS CELL
numbers_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 75]
numbers_list

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 75]

In [38]:
even_l = []
for number in numbers_list:
    if number%2 == 0:
        even_l.append(number)

even_l

[2, 4, 6, 8, 10]

In [39]:
def is_even(my_list):
    even_list = []
    for number in my_list:
        if number%2 == 0:
            even_list.append(number)
    return(even_list)

In [40]:
item = is_even(numbers_list)
item
# print(type(item))

[2, 4, 6, 8, 10]

In [43]:
### filter to capture only numbers that are greater than 2 but less than 8
my_items = list(filter(lambda z: 2 < z < 8 or z == 75, numbers_list))
my_items

[3, 4, 5, 6, 7, 75]

In [33]:
### Find the evens using filter()
evens = list(filter(lambda x: x%2 ==0, numbers_list))
evens

[2, 4, 6, 8, 10]

In [34]:
### Find the odds using filter()
odds = list(filter(lambda y: y%2 == 1, numbers_list))
odds

[1, 3, 5, 7, 9, 75]

In [36]:
odds2 = list(filter(lambda y: y%2 != 0, numbers_list))
odds2

[1, 3, 5, 7, 9, 75]

## Multiple arguments but always one expression

In [44]:
## example of adding two numbers together from lists
all_numbers = list(map(lambda x, y: x + y , evens, odds))
all_numbers

[3, 7, 11, 15, 19]

# In Pandas

In [45]:
import pandas as pd

In [51]:
data = {'Person': ['Susan', 'Mary', 'Peter', 'David', 'Sarah'],
   'fee_2020': [1150, 2300, 3400, 1500, 6500]
           }
df = pd.DataFrame(data)

df

  Person  fee_2020
0  Susan      1150
1   Mary      2300
2  Peter      3400
3  David      1500
4  Sarah      6500

In [54]:
## apply as a lambda expression on our dataframe
## increase consulting fees by 10 percent
df["fee_2021"] = df["fee_2020"].apply(lambda x: x*1.1)
df

  Person  fee_2020  fee_2021
0  Susan      1150    1265.0
1   Mary      2300    2530.0
2  Peter      3400    3740.0
3  David      1500    1650.0
4  Sarah      6500    7150.0

In [53]:
df.drop(["fee_2021"], axis=1)

  Person  fee_2020
0  Susan      1150
1   Mary      2300
2  Peter      3400
3  David      1500
4  Sarah      6500